codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efg144.h
extern volatile __TRISGbits_t TRISGbits __asm__ ("TRISG") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISGSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISGINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RG0:1;
    unsigned RG1:1;
    unsigned :4;
    unsigned RG6:1;
    unsigned RG7:1;
    unsigned RG8:1;
    unsigned RG9:1;
    unsigned :2;
    unsigned RG12:1;
    unsigned RG13:1;
    unsigned RG14:1;
    unsigned RG15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTGbits_t;
extern volatile __PORTGbits_t PORTGbits __asm__ ("PORTG") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTGSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTGINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATG0:1;
    unsigned LATG1:1;
    unsigned :4;
    unsigned LATG6:1;
    unsigned LATG7:1;
    unsigned LATG8:1;
    unsigned LATG9:1;
    unsigned :2;
    unsigned LATG12:1;
    unsigned LATG13:1;
    unsigned LATG14:1;
    unsigned LATG15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATGbits_t;
extern volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs")));
extern volatile unsigned int        LATGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATGSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATGINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCG0:1;
    unsigned ODCG1:1;
    unsigned :4;
    unsigned ODCG6:1;
    unsigned ODCG7:1;
    unsigned ODCG8:1;
    unsigned ODCG9:1;
    unsigned :2;
    unsigned ODCG12:1;
    unsigned ODCG13:1;
    unsigned ODCG14:1;
    unsigned ODCG15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCGbits_t;
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCGSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUG0:1;
    unsigned CNPUG1:1;
    unsigned :4;
    unsigned CNPUG6:1;
    unsigned CNPUG7:1;
    unsigned CNPUG8:1;
    unsigned CNPUG9:1;
    unsigned :2;
    unsigned CNPUG12:1;
    unsigned CNPUG13:1;
    unsigned CNPUG14:1;
    unsigned CNPUG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUGbits_t;
extern volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDG0:1;
    unsigned CNPDG1:1;
    unsigned :4;
    unsigned CNPDG6:1;
    unsigned CNPDG7:1;
    unsigned CNPDG8:1;
    unsigned CNPDG9:1;
    unsigned :2;
    unsigned CNPDG12:1;
    unsigned CNPDG13:1;
    unsigned CNPDG14:1;
    unsigned CNPDG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDGbits_t;
extern volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONGbits_t;
extern volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEG0:1;
    unsigned CNIEG1:1;
    unsigned :4;
    unsigned CNIEG6:1;
    unsigned CNIEG7:1;
    unsigned CNIEG8:1;
    unsigned CNIEG9:1;
    unsigned :2;
    unsigned CNIEG12:1;
    unsigned CNIEG13:1;
    unsigned CNIEG14:1;
    unsigned CNIEG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATG0:1;
    unsigned CNSTATG1:1;
    unsigned :4;
    unsigned CNSTATG6:1;
    unsigned CNSTATG7:1;
    unsigned CNSTATG8:1;
    unsigned CNSTATG9:1;
    unsigned :2;
    unsigned CNSTATG12:1;
    unsigned CNSTATG13:1;
    unsigned CNSTATG14:1;
    unsigned CNSTATG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNNEG __attribute__((section("sfrs")));
typedef struct {
  unsigned :6;
  unsigned CNNEG6:1;
  unsigned :2;
  unsigned CNNEG9:1;
  unsigned :2;
  unsigned CNNEG12:1;
  unsigned CNNEG13:1;
  unsigned CNNEG14:1;
} __CNNEGbits_t;
extern volatile __CNNEGbits_t CNNEGbits __asm__ ("CNNEG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFG __attribute__((section("sfrs")));
typedef struct {
  unsigned CNFG0:1;
  unsigned CNFG1:1;
  unsigned CNFG2:1;
  unsigned CNFG3:1;
  unsigned CNFG4:1;
  unsigned CNFG5:1;
  unsigned CNFG6:1;
  unsigned CNFG7:1;
  unsigned CNFG8:1;
  unsigned CNFG9:1;
  unsigned CNFG10:1;
  unsigned CNFG11:1;
  unsigned CNFG12:1;
  unsigned CNFG13:1;
  unsigned CNFG14:1;
  unsigned CNFG15:1;
} __CNFGbits_t;
extern volatile __CNFGbits_t CNFGbits __asm__ ("CNFG") __attribute__((section("sfrs")));
extern volatile unsigned int        SRCON0G __attribute__((section("sfrs")));
typedef struct {
  unsigned SR0G0:1;
  unsigned SR0G1:1;
  unsigned SR0G2:1;
  unsigned SR0G3:1;
  unsigned SR0G4:1;
  unsigned SR0G5:1;
  unsigned SR0G6:1;
  unsigned SR0G7:1;
  unsigned SR0G8:1;
  unsigned SR0G9:1;
  unsigned SR0G10:1;
  unsigned SR0G11:1;
  unsigned SR0G12:1;
  unsigned SR0G13:1;
  unsigned SR0G14:1;
  unsigned SR0G15:1;
} __SRCON0Gbits_t;
extern volatile __SRCON0Gbits_t SRCON0Gbits __asm__ ("SRCON0G") __attribute__((section("sfrs")));
extern volatile unsigned int        SRCON1G __attribute__((section("sfrs")));
typedef struct {
  unsigned SR1G0:1;
  unsigned SR1G1:1;
  unsigned SR1G2:1;
  unsigned SR1G3:1;
  unsigned SR1G4:1;
  unsigned SR1G5:1;
  unsigned SR1G6:1;
  unsigned SR1G7:1;
  unsigned SR1G8:1;
  unsigned SR1G9:1;
  unsigned SR1G10:1;
  unsigned SR1G11:1;
  unsigned SR1G12:1;
  unsigned SR1G13:1;
  unsigned SR1G14:1;
  unsigned SR1G15:1;
} __SRCON1Gbits_t;
extern volatile __SRCON1Gbits_t SRCON1Gbits __asm__ ("SRCON1G") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ANSH0:1;
    unsigned ANSH1:1;
    unsigned :2;
    unsigned ANSH4:1;
    unsigned ANSH5:1;
    unsigned ANSH6:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELHbits_t;
extern volatile __ANSELHbits_t ANSELHbits __asm__ ("ANSELH") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELHSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELHINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISH0:1;
    unsigned TRISH1:1;
    unsigned TRISH2:1;
    unsigned TRISH3:1;
    unsigned TRISH4:1;
    unsigned TRISH5:1;
    unsigned TRISH6:1;
    unsigned TRISH7:1;
    unsigned TRISH8:1;
    unsigned TRISH9:1;
    unsigned TRISH10:1;
    unsigned TRISH11:1;
    unsigned TRISH12:1;
    unsigned TRISH13:1;
    unsigned TRISH14:1;
    unsigned TRISH15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISHbits_t;
extern volatile __TRISHbits_t TRISHbits __asm__ ("TRISH") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISHSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISHINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RH0:1;
    unsigned RH1:1;
    unsigned RH2:1;
    unsigned RH3:1;
    unsigned RH4:1;
    unsigned RH5:1;
    unsigned RH6:1;
    unsigned RH7:1;
    unsigned RH8:1;
    unsigned RH9:1;
    unsigned RH10:1;
    unsigned RH11:1;
    unsigned RH12:1;
    unsigned RH13:1;
    unsigned RH14:1;
    unsigned RH15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTHbits_t;
extern volatile __PORTHbits_t PORTHbits __asm__ ("PORTH") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTHSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTHINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATH0:1;
    unsigned LATH1:1;
    unsigned LATH2:1;
    unsigned LATH3:1;
    unsigned LATH4:1;
    unsigned LATH5:1;
    unsigned LATH6:1;
    unsigned LATH7:1;
    unsigned LATH8:1;
    unsigned LATH9:1;
    unsigned LATH10:1;
    unsigned LATH11:1;
    unsigned LATH12:1;
    unsigned LATH13:1;
    unsigned LATH14:1;
    unsigned LATH15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATHbits_t;
extern volatile __LATHbits_t LATHbits __asm__ ("LATH") __attribute__((section("sfrs")));
extern volatile unsigned int        LATHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATHSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATHINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCH0:1;
    unsigned ODCH1:1;
    unsigned ODCH2:1;
    unsigned ODCH3:1;
    unsigned ODCH4:1;
    unsigned ODCH5:1;
    unsigned ODCH6:1;
    unsigned ODCH7:1;
    unsigned ODCH8:1;
    unsigned ODCH9:1;
    unsigned ODCH10:1;
    unsigned ODCH11:1;
    unsigned ODCH12:1;
    unsigned ODCH13:1;
    unsigned ODCH14:1;
    unsigned ODCH15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCHbits_t;
extern volatile __ODCHbits_t ODCHbits __asm__ ("ODCH") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCHSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCHINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUH0:1;
    unsigned CNPUH1:1;
    unsigned CNPUH2:1;
    unsigned CNPUH3:1;
    unsigned CNPUH4:1;
    unsigned CNPUH5:1;
    unsigned CNPUH6:1;
    unsigned CNPUH7:1;
    unsigned CNPUH8:1;
    unsigned CNPUH9:1;
    unsigned CNPUH10:1;
    unsigned CNPUH11:1;
    unsigned CNPUH12:1;
    unsigned CNPUH13:1;
    unsigned CNPUH14:1;
    unsigned CNPUH15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUHbits_t;
