codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efg144.h
#define _CNNEJ_CNNEJ5_POSITION                   0x00000005
#define _CNNEJ_CNNEJ5_MASK                       0x00000020
#define _CNNEJ_CNNEJ5_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ6_POSITION                   0x00000006
#define _CNNEJ_CNNEJ6_MASK                       0x00000040
#define _CNNEJ_CNNEJ6_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ7_POSITION                   0x00000007
#define _CNNEJ_CNNEJ7_MASK                       0x00000080
#define _CNNEJ_CNNEJ7_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ8_POSITION                   0x00000008
#define _CNNEJ_CNNEJ8_MASK                       0x00000100
#define _CNNEJ_CNNEJ8_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ9_POSITION                   0x00000009
#define _CNNEJ_CNNEJ9_MASK                       0x00000200
#define _CNNEJ_CNNEJ9_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ10_POSITION                  0x0000000A
#define _CNNEJ_CNNEJ10_MASK                      0x00000400
#define _CNNEJ_CNNEJ10_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ11_POSITION                  0x0000000B
#define _CNNEJ_CNNEJ11_MASK                      0x00000800
#define _CNNEJ_CNNEJ11_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ12_POSITION                  0x0000000C
#define _CNNEJ_CNNEJ12_MASK                      0x00001000
#define _CNNEJ_CNNEJ12_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ13_POSITION                  0x0000000D
#define _CNNEJ_CNNEJ13_MASK                      0x00002000
#define _CNNEJ_CNNEJ13_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ14_POSITION                  0x0000000E
#define _CNNEJ_CNNEJ14_MASK                      0x00004000
#define _CNNEJ_CNNEJ14_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ15_POSITION                  0x0000000F
#define _CNNEJ_CNNEJ15_MASK                      0x00008000
#define _CNNEJ_CNNEJ15_LENGTH                    0x00000001

#define _CNFJ_CNFJ0_POSITION                     0x00000000
#define _CNFJ_CNFJ0_MASK                         0x00000001
#define _CNFJ_CNFJ0_LENGTH                       0x00000001

#define _CNFJ_CNFJ1_POSITION                     0x00000001
#define _CNFJ_CNFJ1_MASK                         0x00000002
#define _CNFJ_CNFJ1_LENGTH                       0x00000001

#define _CNFJ_CNFJ2_POSITION                     0x00000002
#define _CNFJ_CNFJ2_MASK                         0x00000004
#define _CNFJ_CNFJ2_LENGTH                       0x00000001

#define _CNFJ_CNFJ3_POSITION                     0x00000003
#define _CNFJ_CNFJ3_MASK                         0x00000008
#define _CNFJ_CNFJ3_LENGTH                       0x00000001

#define _CNFJ_CNFJ4_POSITION                     0x00000004
#define _CNFJ_CNFJ4_MASK                         0x00000010
#define _CNFJ_CNFJ4_LENGTH                       0x00000001

#define _CNFJ_CNFJ5_POSITION                     0x00000005
#define _CNFJ_CNFJ5_MASK                         0x00000020
#define _CNFJ_CNFJ5_LENGTH                       0x00000001

#define _CNFJ_CNFJ6_POSITION                     0x00000006
#define _CNFJ_CNFJ6_MASK                         0x00000040
#define _CNFJ_CNFJ6_LENGTH                       0x00000001

#define _CNFJ_CNFJ7_POSITION                     0x00000007
#define _CNFJ_CNFJ7_MASK                         0x00000080
#define _CNFJ_CNFJ7_LENGTH                       0x00000001

#define _CNFJ_CNFJ8_POSITION                     0x00000008
#define _CNFJ_CNFJ8_MASK                         0x00000100
#define _CNFJ_CNFJ8_LENGTH                       0x00000001

#define _CNFJ_CNFJ9_POSITION                     0x00000009
#define _CNFJ_CNFJ9_MASK                         0x00000200
#define _CNFJ_CNFJ9_LENGTH                       0x00000001

#define _CNFJ_CNFJ10_POSITION                    0x0000000A
#define _CNFJ_CNFJ10_MASK                        0x00000400
#define _CNFJ_CNFJ10_LENGTH                      0x00000001

#define _CNFJ_CNFJ11_POSITION                    0x0000000B
#define _CNFJ_CNFJ11_MASK                        0x00000800
#define _CNFJ_CNFJ11_LENGTH                      0x00000001

#define _CNFJ_CNFJ12_POSITION                    0x0000000C
#define _CNFJ_CNFJ12_MASK                        0x00001000
#define _CNFJ_CNFJ12_LENGTH                      0x00000001

#define _CNFJ_CNFJ13_POSITION                    0x0000000D
#define _CNFJ_CNFJ13_MASK                        0x00002000
#define _CNFJ_CNFJ13_LENGTH                      0x00000001

#define _CNFJ_CNFJ14_POSITION                    0x0000000E
#define _CNFJ_CNFJ14_MASK                        0x00004000
#define _CNFJ_CNFJ14_LENGTH                      0x00000001

#define _CNFJ_CNFJ15_POSITION                    0x0000000F
#define _CNFJ_CNFJ15_MASK                        0x00008000
#define _CNFJ_CNFJ15_LENGTH                      0x00000001

#define _TRISK_TRISK0_POSITION                   0x00000000
#define _TRISK_TRISK0_MASK                       0x00000001
#define _TRISK_TRISK0_LENGTH                     0x00000001

#define _TRISK_TRISK1_POSITION                   0x00000001
#define _TRISK_TRISK1_MASK                       0x00000002
#define _TRISK_TRISK1_LENGTH                     0x00000001

#define _TRISK_TRISK2_POSITION                   0x00000002
#define _TRISK_TRISK2_MASK                       0x00000004
#define _TRISK_TRISK2_LENGTH                     0x00000001

#define _TRISK_TRISK3_POSITION                   0x00000003
#define _TRISK_TRISK3_MASK                       0x00000008
#define _TRISK_TRISK3_LENGTH                     0x00000001

#define _TRISK_TRISK4_POSITION                   0x00000004
#define _TRISK_TRISK4_MASK                       0x00000010
#define _TRISK_TRISK4_LENGTH                     0x00000001

#define _TRISK_TRISK5_POSITION                   0x00000005
#define _TRISK_TRISK5_MASK                       0x00000020
#define _TRISK_TRISK5_LENGTH                     0x00000001

#define _TRISK_TRISK6_POSITION                   0x00000006
#define _TRISK_TRISK6_MASK                       0x00000040
#define _TRISK_TRISK6_LENGTH                     0x00000001

